
jiwon_dict = {
    "01": ("서울중앙지방법원", "101", "B000210"),
    "02": ("서울동부지방법원", "102", "B000211"),
    "03": ("서울서부지방법원", "103", "B000215"),
    "04": ("서울남부지방법원", "104", "B000212"),
    "05": ("서울북부지방법원", "105", "B000213"),
    "06": ("의정부지방법원", "106", "B000214"),
    "07": ("고양지원", "107", "B214807"),
    "08": ("인천지방법원", "201", "B000240"),
    "09": ("부천지원", "202", "B000241"),
    "10": ("수원지방법원", "301", "B000250"),
    "11": ("성남지원", "302", "B000251"),
    "12": ("여주지원", "303", "B000252"),
    "13": ("평택지원", "304", "B000253"),
    "14": ("안산지원", "305", "B250826"),
    "15": ("안양지원", "306", "B000254"),
    "16": ("춘천지방법원", "501", "B000260"),
    "17": ("강릉지원", "503", "B000261"),
    "18": ("원주지원", "502", "B000262"),
    "19": ("속초지원", "504", "B000263"),
    "20": ("영월지원", "505", "B000264"),
    "21": ("청주지방법원", "A01", "B000270"),
    "22": ("충주지원", "A02", "B000271"),
    "23": ("제천지원", "A03", "B000272"),
    "24": ("영동지원", "A04", "B000273"),
    "25": ("대전지방법원", "401", "B000280"),
    "26": ("홍성지원", "405", "B000281"),
    "27": ("논산지원", "406", "B000282"),
    "28": ("천안지원", "402", "B000283"),
    "29": ("공주지원", "403", "B000284"),
    "30": ("서산지원", "404", "B000285"),
    "31": ("대구지방법원", "701", "B000310"),
    "32": ("안동지원", "707", "B000311"),
    "33": ("경주지원", "702", "B000312"),
    "34": ("김천지원", "703", "B000313"),
    "35": ("상주지원", "704", "B000314"),
    "36": ("의성지원", "705", "B000315"),
    "37": ("영덕지원", "706", "B000316"),
    "38": ("포항지원", "708", "B000317"),
    "39": ("대구서부지원", "709", "B000320"),
    "40": ("부산지방법원", "601", "B000410"),
    "41": ("부산동부지원", "602", "B000412"),
    "42": ("부산서부지원", "603", "B000414"),
    "43": ("울산지방법원", "D01", "B000411"),
    "44": ("창원지방법원", "B01", "B000420"),
    "45": ("마산지원", "B06", "B000431"),
    "46": ("진주지원", "B05", "B000421"),
    "47": ("통영지원", "B02", "B000422"),
    "48": ("밀양지원", "B04", "B000423"),
    "49": ("거창지원", "B03", "B000424"),
    "50": ("광주지방법원", "801", "B000510"),
    "51": ("목포지원", "802", "B000511"),
    "52": ("장흥지원", "805", "B000512"),
    "53": ("순천지원", "803", "B000513"),
    "54": ("해남지원", "804", "B000514"),
    "55": ("전주지방법원", "C01", "B000520"),
    "56": ("군산지원", "C03", "B000521"),
    "57": ("정읍지원", "C04", "B000522"),
    "58": ("남원지원", "C02", "B000523"),
    "59": ("제주지방법원", "901", "B000530"),
    "61": ("남양주지원", "108", "B214804")
}

def convert_jiwon_code(input_value, output_type):
    reverse_map = {}
    field_names = ["jiwon_code", "jiwon_name", "daum_jiwon_code", "renew_jiwon_code"]
    
    for key, values in jiwon_dict.items():
        reverse_map[key] = (key, *values)
        for idx, value in enumerate(values):
            reverse_map[value] = (key, *values)
    
    if input_value in reverse_map:
        mapped_values = reverse_map[input_value]
        if output_type in field_names:
            return mapped_values[field_names.index(output_type)]
        else:
            return None  # 유효하지 않은 output_type 처리
    else:
        return None  # 입력값이 존재하지 않을 경우


def dooin_court_code(court_code_2_digit):
    """
    Converts a 2-digit court code into a 4-digit court code.

    :param court_code_2_digit: A 2-digit court code as string.
    :return: A 4-digit court code as string or '0000' if not found.
    """
    # Mapping for 2-digit court codes to 4-digit options
    court_code_map = {
        '01': '1010',
        '02': '1110',
        '03': '1210',
        '04': '1310',
        '05': '1410',
        '06': '1510',
        '07': '1511',
        '61': '1512',
        '08': '1610',
        '09': '1611',
        '10': '1710',
        '11': '1711',
        '12': '1712',
        '13': '1713',
        '14': '1714',
        '15': '1715',
        '16': '1810',
        '17': '1811',
        '18': '1812',
        '19': '1813',
        '20': '1814',
        '21': '1910',
        '22': '1911',
        '23': '1912',
        '24': '1913',
        '25': '2010',
        '26': '2011',
        '27': '2012',
        '28': '2013',
        '29': '2014',
        '30': '2015',
        '31': '2110',
        '32': '2112',
        '33': '2113',
        '34': '2114',
        '35': '2115',
        '36': '2116',
        '37': '2117',
        '38': '2118',
        '39': '2111',
        '40': '2210',
        '41': '2211',
        '42': '2212',
        '43': '2310',
        '44': '2410',
        '45': '2411',
        '46': '2412',
        '47': '2413',
        '48': '2414',
        '49': '2415',
        '50': '2510',
        '51': '2511',
        '52': '2512',
        '53': '2513',
        '54': '2514',
        '55': '2610',
        '56': '2611',
        '57': '2612',
        '58': '2613',
        '59': '2710'
    }
    return court_code_map.get(court_code_2_digit, "0000")  # Default to '0000' if not found


